paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_211_drv.c
	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P1SKIP = P1SKIP_B0__SKIPPED 			//because p1.0 is set analog mode and p1.2 and p1.3 are used to Smbus ,so this bit must be skipped are used for mointor the 3.3V module input voltage
			| P1SKIP_B1__SKIPPED			//set p1.1 skip in order to p1.2 and p1.3 are used for i2c master mode
			| P1SKIP_B2__NOT_SKIPPED | P1SKIP_B3__NOT_SKIPPED

			//because P2.0 and p2.1 are used for i2c slave mode,so P1.0 ~ P1.7 must be skipped
			| P1SKIP_B4__SKIPPED | P1SKIP_B5__SKIPPED| P1SKIP_B6__SKIPPED | P1SKIP_B7__SKIPPED;

#if defined(HW_VER_MAXIM_AM1_211)
	//5. set p1MASK
	P1MASK = P1MASK_B0__COMPARED | P1MASK_B1__IGNORED | P1MASK_B2__IGNORED
			| P1MASK_B3__IGNORED | P1MASK_B4__IGNORED | P1MASK_B5__IGNORED
			| P1MASK_B6__IGNORED | P1MASK_B7__IGNORED;
#endif

#if defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)
	//5. set p1MASK
	P1MASK = P1MASK_B0__IGNORED | P1MASK_B1__IGNORED | P1MASK_B2__IGNORED
			| P1MASK_B3__IGNORED | P1MASK_B4__IGNORED | P1MASK_B5__IGNORED
			| P1MASK_B6__IGNORED | P1MASK_B7__IGNORED;
#endif

	//6. set P1MAT
	P1MAT = P1MAT_B0__HIGH | P1MAT_B1__HIGH | P1MAT_B2__HIGH | P1MAT_B3__HIGH
			| P1MAT_B4__HIGH | P1MAT_B5__HIGH | P1MAT_B6__HIGH | P1MAT_B7__HIGH;

	SFRPAGE = SFRPAGE_SAVE;
}


static void _cwdm4_211_port2_init()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x20;
	//1.set port default value
	P2 = P2_B0__HIGH | P2_B1__HIGH | P2_B2__HIGH | P2_B3__HIGH | P2_B4__HIGH | P2_B5__HIGH | P2_B6__HIGH ;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P2MDIN = P2MDIN_B0__DIGITAL | P2MDIN_B1__DIGITAL	 //set p2.0 and p2.1 digital mode are used for i2c slave mode
			| P2MDIN_B2__DIGITAL   	  //not used
			| P2MDIN_B3__DIGITAL   	  //not used
			| P2MDIN_B4__DIGITAL      //not used
			| P2MDIN_B5__ANALOG       //used for RSSI0
			| P2MDIN_B6__DIGITAL ;    //not used

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).

	P2MDOUT = P2MDOUT_B0__OPEN_DRAIN | P2MDOUT_B1__OPEN_DRAIN //set p2.0 and p2.1 open drain mode are used for i2c slave mode
			| P2MDOUT_B2__OPEN_DRAIN	 //not used
			| P2MDOUT_B3__OPEN_DRAIN     //not used
			| P2MDOUT_B4__OPEN_DRAIN     //not used
			| P2MDOUT_B5__OPEN_DRAIN     //used for RSSI0
			| P2MDOUT_B6__OPEN_DRAIN;    //not used

	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P2SKIP = P2SKIP_B0__SKIPPED | P2SKIP_B1__SKIPPED   		//set p2.0 and p2.1 skipped for i2c slave mode
			| P2SKIP_B2__SKIPPED

			//because p2.5 is set analog mode ,so this bit must be skipped is used for for RSSI
			| 0x20;

	//5. set p2MASK
	P2MASK = P2MASK_B0__IGNORED | P2MASK_B1__IGNORED | P2MASK_B2__IGNORED
			| P2MASK_B3__IGNORED | P2MASK_B4__IGNORED | P2MASK_B5__IGNORED
			| P2MASK_B6__IGNORED ;

	//6. set P2MAT
	P2MAT = P2MAT_B0__HIGH | P2MAT_B1__HIGH | P2MAT_B2__HIGH | P2MAT_B3__HIGH
			| P2MAT_B4__HIGH | P2MAT_B5__HIGH | P2MAT_B6__HIGH ;

	SFRPAGE = SFRPAGE_SAVE;
}

static void _cwdm4_211_port3_init()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x20;
	//1.set port default value
	P3 = P3_B0__HIGH | P3_B1__HIGH | P3_B2__HIGH | P3_B3__HIGH | P3_B4__HIGH | P3_B7__HIGH;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P3MDIN = P3MDIN_B0__DIGITAL    //set p3.0 digital mode is INITL
			| P3MDIN_B1__DIGITAL   //set p3.1 digital mode is V3P3_EN
			| P3MDIN_B2__DIGITAL   //not used
			| P3MDIN_B3__DIGITAL   //not used
			| P3MDIN_B4__DIGITAL   //not used
			| P3MDIN_B7__DIGITAL;   //not used

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P3MDOUT = P3MDOUT_B0__OPEN_DRAIN   //because p3.0 is used INITL
			| P3MDOUT_B1__PUSH_PULL   //because p3.1 is used V3P3_EN
			| P3MDOUT_B2__OPEN_DRAIN   //not used
			| P3MDOUT_B3__OPEN_DRAIN   //not used 
			| P3MDOUT_B4__OPEN_DRAIN   //not used
		    | P3MDOUT_B7__OPEN_DRAIN;  //not used

	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).

	//p3 do't have p3SKIP registers

	//5. set p2MASK
	//p3 do't have P3MASK registers

	//6. set P2MAT
	//p3 do't have P3MAT registers
	SFRPAGE = SFRPAGE_SAVE;
}

static bool _cwdm4_211_txcdr_check_exist()
{
	uint8_t i = 0, value = 0;

	for(i = 0; i < 3; i++)
	{
		if(GOS_OK == SMB_read_byte(CWDM4_211_TXCDR_BASE_ADDR, 0x0, &value))
		{
			_i2c_dev_ready |= TX_READY;
			return true;
		}
		TIMER5_hw_delay_us(5000);
	}

	return false;
}

static bool _cwdm4_211_rxcdr_check_exist()
{
	uint8_t i = 0, value = 0;

	for(i = 0; i < 3; i++)
	{
		if(GOS_OK == SMB_read_byte(CWDM4_211_RXCDR_BASE_ADDR, 0x0, &value))
		{
			_i2c_dev_ready |= RX_READY;
			return true;
		}
		TIMER5_hw_delay_us(5000);
	}

	return false;
}

static uint8_t _cwdm4_211_rxcdr_m37244_i2c_read_byte(uint8_t OffsetAddr, uint8_t *Data)
{
	if((_i2c_dev_ready & RX_READY) == 0x0)
	{
		return GOS_FAIL;
	}
	return SMB_read_byte(CWDM4_211_RXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _cwdm4_211_rxcdr_m37244_i2c_write_byte(uint8_t OffsetAddr,uint8_t Data)
{
	if((_i2c_dev_ready & RX_READY) == 0x0)
	{
		return GOS_FAIL;
	}
	return SMB_write_byte(CWDM4_211_RXCDR_BASE_ADDR, OffsetAddr, Data);
}

#if defined(HW_VER_SEMTEC_AM1_211)

static uint8_t _cwdm4_211_txcdr_gn2105_i2c_read_byte(uint16_t OffsetAddr, uint8_t *Data)
{
	if((_i2c_dev_ready & TX_READY) == 0x0)
	{
		return GOS_FAIL;
	}
	return SMB_read_byte(CWDM4_211_TXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _cwdm4_211_txcdr_gn2105_i2c_write_byte(uint16_t OffsetAddr, uint8_t Data)
{
	if((_i2c_dev_ready & TX_READY) == 0x0)
	{
		return GOS_FAIL;
	}
	return SMB_write_byte(CWDM4_211_TXCDR_BASE_ADDR, OffsetAddr, Data);
}

static void _cwdm4_211_txcdr_gn2105_reset()
{
	TX_RST = 0;  //reset cdr
	Soft_timer_delay_ms(10);
	TX_RST = 1;  //restore cdr

	if(_cwdm4_211_txcdr_check_exist())
	{
		_i2c_dev_ready |= TX_READY;
	}
}

static void _cwdm4_211_txcdr_gn2105_init()
{
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x472,0x00);  //PD_ALL    power on
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x078,0x00);  //L0_PD_LANE
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x178,0x00);  //L1_PD_LANE
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x278,0x00);  //L2_PD_LANE
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x378,0x00);  //L3_PD_LANE

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x448,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x449,0x00);    //ADC_PARAM_MON_CTRL_RESET
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x473,0x00);    //PD_SENSE_REG_0
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x433,0x00);    //TXDSBL_SOFT

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x078,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x079,0x01);

