paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_211_drv.c
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x084,0x01);  // bias enable
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x184,0x01);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x284,0x01);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x384,0x01);

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x01c,0x02);  //L*_DRV_IMON_CTRL
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x11c,0x02);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x21c,0x02);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x31c,0x02);

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x01b,0x00);  //L*L*_DRV_PD_MON_REG_0
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x11b,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x21b,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x31b,0x00);

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x082,0x00);  // bias override
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x083,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x182,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x183,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x282,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x283,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x382,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x383,0x00);

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x087,0x01);  // ch0 mod enable
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x187,0x01);  // ch1 mod enable
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x287,0x01);  // ch2 mod enable
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x387,0x01);  // ch3 mod enable

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x085,0x00);  // ch0 Imod_dac_low
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x086,0x00);  // ch0 Imod_dac_high

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x185,0x00);  // ch1 Imod_dac_low
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x186,0x00);  // ch1 Imod_dac_high

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x285,0x00);  // ch2 Imod_dac_low
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x286,0x00);  // ch2 Imod_dac_high

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x385,0x00);  // ch3 Imod_dac_low
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x386,0x00);  // ch3 Imod_dac_high

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x023,0x1f);  // ch0 Icross_dac_low
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x024,0x10);  // ch0 Icross_dac_high

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x123,0x1f);  // ch1 Icross_dac_low
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x124,0x10);  // ch1 Icross_dac_high

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x223,0x1f);  // ch2 Icross_dac_low
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x224,0x10);  // ch2 Icross_dac_high

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x323,0x1f);  // ch3 Icross_dac_low
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x324,0x10);  // ch3 Icross_dac_high

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x08a,0x01);  // ch0 hfde enable
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x18a,0x01);  // ch1 hfde enable
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x28a,0x01);  // ch2 hfde enable
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x38a,0x01);  // ch3 hfde enable

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x088,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x089,0x00);

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x188,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x189,0x00);

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x288,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x289,0x00);

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x388,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x389,0x00);

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x08d,0x01);  // ch0 lfde enable
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x18d,0x01);  // ch1 lfde enable
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x28d,0x01);  // ch2 lfde enable
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x38d,0x01);  // ch3 lfde enable

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x08b,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x08c,0x00);

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x18b,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x18c,0x00);

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x28b,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x28c,0x00);

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x38b,0x00);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x38c,0x00);
}

#endif

#if defined(HW_VER_MAXIM_AM1_211) || defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)
static uint8_t _cwdm4_211_txcdr_max24025_i2c_read_byte(uint16_t OffsetAddr, uint8_t *Data)
{
	if((_i2c_dev_ready & TX_READY) == 0x0)
	{
		return GOS_FAIL;
	}
	return SMB_read_byte(CWDM4_211_TXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _cwdm4_211_txcdr_max24025_i2c_write_byte(uint16_t OffsetAddr, uint8_t Data)
{
	if((_i2c_dev_ready & TX_READY) == 0x0)
	{
		return GOS_FAIL;
	}
	return SMB_write_byte(CWDM4_211_TXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _cwdm4_211_txcdr_max24025_check_vcc1()
{
	uint8_t value = 0, i = 0;
	QSFP_MSA_PAGE_T  *lower_page  = MSA_get_page_ptr(MSA_PAGE_LOWER);
	MSA_PAGE_LOWER_ISR_FLAG_T  *isr_flag = (MSA_PAGE_LOWER_ISR_FLAG_T *)&(lower_page->ptr[MSA_OFFSET_LOWER_LOS]);

	for(i = 0; i < 50; i++)
	{
	   value = 0;
	   _cwdm4_211_txcdr_max24025_i2c_read_byte(0x1e, &value);

	   if(((value & 0xE0) >> 5) == 0x2)  //txcdr chip vcc check OK
	   {
		   return true;
	   }
	   TIMER5_hw_delay_us(10);  //delay 10us
	}

	isr_flag->tx_fault |= 0xF;  //if vcc1 is error, report tx_fault
	return false;
}

static uint8_t _cwdm4_211_txcdr_max24025_check_vcc2(uint8_t ch)
{
	uint8_t value = 0, i = 0;
	const uint8_t page_select[] = {0x12, 0x52, 0x92, 0xd2};
	QSFP_MSA_PAGE_T  *lower_page  = MSA_get_page_ptr(MSA_PAGE_LOWER);
	MSA_PAGE_LOWER_ISR_FLAG_T  *isr_flag = (MSA_PAGE_LOWER_ISR_FLAG_T *)&(lower_page->ptr[MSA_OFFSET_LOWER_LOS]);

	_cwdm4_211_txcdr_max24025_i2c_write_byte(0x00, page_select[ch]);

	for (i = 0; i < 50; i++)
	{
		value = 0;
		_cwdm4_211_txcdr_max24025_i2c_read_byte(0x1f, &value);

		if(GET_BIT(value, 6) == 0x0)
		{
			return true;
		}
		TIMER5_hw_delay_us(10);  //delay 10us
	}

	isr_flag->tx_fault |= 0xF;  //if vcc2 is error, report tx_fault
	return false;
}

static void _cwdm4_211_txcdr_max24025_reset()
{
	uint8_t value = 0, ch = 0;

	_cwdm4_211_txcdr_check_exist();

	if(_cwdm4_211_txcdr_max24025_check_vcc1())
	{
		for(ch = 0; ch < MSA_CHANNEL_NUM; ch++)
		{
			if(_cwdm4_211_txcdr_max24025_check_vcc2(ch) == false)
			{
				break;  //if there is  one channel is not equal 0, vcc2 check failed
			}
		}
	}

	if(ch == MSA_CHANNEL_NUM) //indicates all 4 channels both are 0
	{
		TX_DIS = 1;  //there must be disable tx before soft reset
		value = 0x1;
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x01, value);
	}

	TIMER5_hw_delay_us(150);  //delay 150us
}

static void _cwdm4_211_txcdr_max24025_init()
{
	uint8_t ch = 0, value = 0;
	const uint8_t page_select[] = {0x12, 0x52, 0x92, 0xd2};

	for(ch = 0; ch < MSA_CHANNEL_NUM; ch++)
	{
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x00,page_select[ch]);     //select page
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x02,0xff);    			//turn on CDR
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x04,0x8a);  				//set CDR_BW 30M
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x06,0x26); 				//set CDR_BW 30M
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x08,0x24);  				//Mask VOUT low fault and TIN_LOL fault
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x09,0x5e);  				//Unmask TIN_LOS INT
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x0a,0x1f);  				//Unmask CDR_LOL INT
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x0c,0xda);  				//TX_EQ setting
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x0e,0x2a);   				//ty_eye crossing adjusting
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x0f,0x24);   				//DE_BAL
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x10,0x28);  				//LFDE_AMP
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x11,0x60); 				//HFDE_AMP
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x12,0x07);  				//LFDE_TIME
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x13,0x07);  				//HFDE_TIME
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x14,0xaf);  				//DCMAX
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x15,0x96); 				//MODMAX
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x16,0x26);  				//IDC_DAC
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x17,0x00);  				//DCINC
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x18,0x35);  				//MOD_DAC
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x19,0x00); 				//MODINC
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x1a,0x13);  				//tx_en enable
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x1b,0x07);  				//VLFDE_AMP

