paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_211_drv.c
		_cwdm4_211_txcdr_max24025_i2c_read_byte(0x1f, &value); 				//clear interrupt status because default state is high
		_cwdm4_211_txcdr_max24025_i2c_read_byte(0x24, &value); 				//clear interrupt status because default state is high
	}

	_cwdm4_211_txcdr_max24025_i2c_write_byte(0x00,page_select[3]);      //select page4
	_cwdm4_211_txcdr_max24025_i2c_write_byte(0x0f,0x37);   				//DE_BAL
	_cwdm4_211_txcdr_max24025_i2c_write_byte(0x11,0x7c); 				//HFDE_AMP
}

#endif  //defined(HW_VER_MAXIM_AM1_211) || defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)

static void _cwdm4_211_rxcdr_m37244_init()
{
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x03,0xf0);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x10,0xf0);  //default is in lower power mode, rx output disable
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x16,0x0f);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x19,0xff);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x1b,0x03);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x23,0xf0);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x40,0xf0);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x42,0x1e);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x43,0x1e);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x44,0x1e);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x45,0x1e);
}

static void _cwdm4_211_rxcdr_m37244_reset()
{
	_cwdm4_211_rxcdr_check_exist();

	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x02, 0xaa);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x02, 0x00);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x03, 0xf0);
}

#if defined(HW_VER_SEMTEC_AM1_211)
static void _cwdm4_211_get_bias_average_value(uint8_t channel, uint16_t *bias_dac, uint16_t *mod_dac)
{
	const uint16_t sink_reg[] = {0x070, 0x170, 0x270, 0x370};
	const uint16_t mon_reg[]  = {0x01b, 0x11b, 0x21b, 0x31b};
	const uint16_t mod_reg[]  = {0x06e, 0x16e, 0x26e, 0x36e};
	uint16_t buff16[AVERAGE_MAX_COUNTER] = {0};
	uint8_t i = 0, value_h = 0, value_l = 0;

	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x449, 0);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(mon_reg[channel], 0);

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		_cwdm4_211_txcdr_gn2105_i2c_read_byte(sink_reg[channel], &value_l);
		_cwdm4_211_txcdr_gn2105_i2c_read_byte(sink_reg[channel] + 1, &value_h); //bit9 8
		buff16[i] = value_l | ((value_h & 0x0F) << 8);
	}

	*bias_dac = com_average_value16(buff16, AVERAGE_MAX_COUNTER);

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		_cwdm4_211_txcdr_gn2105_i2c_read_byte(mod_reg[channel], &value_l);
		_cwdm4_211_txcdr_gn2105_i2c_read_byte(mod_reg[channel] + 1, &value_h); //bit9 8
		buff16[i] = value_l | ((value_h & 0x0F) << 8);
	}

	*mod_dac = com_average_value16(buff16, AVERAGE_MAX_COUNTER);
}
#endif

#if defined(HW_VER_MAXIM_AM1_211) || defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)
static void _cwdm4_211_get_bias_average_value(uint8_t channel, uint16_t *bias_dac, uint16_t *mod_dac)
{
	uint16_t buff16[AVERAGE_MAX_COUNTER] = {0};
	uint8_t i = 0, value_h = 0, value_l = 0;
	const uint8_t page_select[] = {0x12, 0x52, 0x92, 0xd2};

	_cwdm4_211_txcdr_max24025_i2c_write_byte(0x00, page_select[channel]);

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		_cwdm4_211_txcdr_max24025_i2c_read_byte(0x16, &value_h);
		_cwdm4_211_txcdr_max24025_i2c_read_byte(0x17, &value_l);
		buff16[i] = value_h << 2 | ((value_l & 0xC0) >> 6);
	}
	*bias_dac = com_average_value16(buff16, AVERAGE_MAX_COUNTER);

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		_cwdm4_211_txcdr_max24025_i2c_read_byte(0x18, &value_h);
		_cwdm4_211_txcdr_max24025_i2c_read_byte(0x19, &value_l);
		buff16[i] = value_h << 1 | ((value_l & 0x80) >> 7);
	}
	*mod_dac = com_average_value16(buff16, AVERAGE_MAX_COUNTER);
}
#endif

#if defined(HW_VER_SEMTEC_AM1_211)
/* Return in 0.1mA */
static float cwdm4_211_get_bias(uint8_t channel)
{
	float result = 0.0;
	uint16_t  sink_dac = 0, mod_dac = 0;
	uint8_t   RPP = 0;

	_cwdm4_211_txcdr_gn2105_i2c_read_byte(0x466, &RPP);
	_cwdm4_211_get_bias_average_value(channel, &sink_dac, &mod_dac);
	result = ((float)sink_dac / (4095.0 * 8.774 * (1.145845 - 0.00463 * (float)RPP)) + (float)mod_dac / (2.0 * 4095.0 * 6.701 * (1.145845 - 0.00463 * (float)RPP))) * 1000.0 * 10.0;   //0.1mA
	return result;
}
#endif

#if defined(HW_VER_MAXIM_AM1_211) || defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)
/* Return in 0.1mA */
static float cwdm4_211_get_bias(uint8_t channel)
{
	float imod_ua = 0.0, idc_ua = 0.0, hfde = 0.0, lfde = 0.0, result = 0.0;
	uint16_t value16 = 0, mod_dac = 0, bias_dac = 0;
	uint8_t value_h =0,  value_l = 0;

	_cwdm4_211_get_bias_average_value(channel, &bias_dac, &mod_dac);

	idc_ua = (float)bias_dac * 67.5;
	imod_ua = (float)(mod_dac + 16) * 280.0;

	_cwdm4_211_txcdr_max24025_i2c_read_byte(0x10, &value_h);
	lfde = (float)((value_h & 0x2F) + 1) / 256.0;

	_cwdm4_211_txcdr_max24025_i2c_read_byte(0x11, &value_h);
	hfde = (float)((value_h & 0x2F) + 1) / 256.0;

	result = (idc_ua + imod_ua/2.0  * (1.0 + lfde + hfde)) / 1000.0 * 10.0; //uint:0.1mA
	return result;
}
#endif

static uint16_t _cwdm4_211_get_rssi_average_value()
{
	uint8_t i = 0;
	uint16_t buff16[AVERAGE_MAX_COUNTER] = {0};

	ADC0_manual_poll(ADC0_RSSI0);
	ADC0_manual_poll(ADC0_RSSI0);
	ADC0_manual_poll(ADC0_RSSI0);  //because the first poll get rssi adc values are error, discard top three times results

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		buff16[i] = ADC0_manual_poll(ADC0_RSSI0) * 0.1;   // uint:mv
	}
	return com_average_value16(buff16, AVERAGE_MAX_COUNTER);
}

static uint16_t cwdm4_211_ddmi_get_rssi(uint8_t channel)
{
	uint8_t value = 0, i = 0;
	uint16_t rssi_mv = 0;

	channel = 3 - channel;  //rxcdr pin is inverted sequence with qsfp28 pin

	_cwdm4_211_rxcdr_m37244_i2c_read_byte(0x3, &value);

	value = SET_BIT(value,6);  //rssi enable

	value = (value & 0xCF) | (channel << 4);  //select channel, 0x3[5:4]

	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x3, value);

	rssi_mv = _cwdm4_211_get_rssi_average_value();

	return (uint16_t) ((float)rssi_mv / (float)CWDM4_211_RSSI_SERIES_RES * 1000.00);
}

static uint16_t cwdm4_211_ddmi_get_txmon(uint8_t channel)
{
	const uint16_t up_vcc = ADC0_get_vcc();
	const uint16_t mpd = ADC0_get_mpd(channel);

