paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_211_drv.c
	if(up_vcc >= mpd)
	{
		return up_vcc - mpd;
	}
	else
	{
		return 0;
	}
}

static void  cwdm4_211_drv_check_laser_ch(SFP_DRV_LASER_CFG_T *cfg)
{
#if defined(HW_VER_SEMTEC_AM1_211)
	if(cfg->bias > 1000)
	{
		cfg->bias = 800;
	}
	if(cfg->mod > 1000)
	{
		cfg->mod = 800;
	}
#endif

#if defined(HW_VER_MAXIM_AM1_211) || defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)
	if(cfg->bias > 700)
	{
		cfg->bias = 700;
	}
	if(cfg->mod > 280)
	{
		cfg->mod = 280;
	}
	if(cfg->cross > 42)
	{
		cfg->cross = 42;
	}
#endif

}

//***********************************************public function***************************************/

void CWDM4_211_chip_reset(void)
{
#if defined(HW_VER_SEMTEC_AM1_211)
	_cwdm4_211_txcdr_gn2105_reset();
#endif

#if defined(HW_VER_MAXIM_AM1_211) || defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)
	_cwdm4_211_txcdr_max24025_reset();
#endif

	_cwdm4_211_rxcdr_m37244_reset();
}

void CWDM4_211_port_init(void)// mcu_port_init
{
	_cwdm4_211_port0_init();
	_cwdm4_211_port1_init();
	_cwdm4_211_port2_init();
	_cwdm4_211_port3_init();
}

void CWDM4_211_chip_init(void)		// init
{
	CWDM4_211_chip_reset();

#if defined(HW_VER_SEMTEC_AM1_211)
	_cwdm4_211_txcdr_gn2105_init();
#endif

#if defined(HW_VER_MAXIM_AM1_211) || defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)
	_cwdm4_211_txcdr_max24025_init();
#endif
	_cwdm4_211_rxcdr_m37244_init();
}

int16_t CWDM4_211_ddmi_get_temp(MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		return ((int16_t)((float)(ddmi_cali->temp) * TIMER_temp_slow_boot_cal()) + ADC0_get_mcu_temp()); 		//MSA format uint: 1/256 C
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return  ((int16_t)ADC0_get_mcu_temp());  //MSA format uint:1/256ÉãÊÏ¶È
	}

	return GOS_FAIL;
}

uint16_t CWDM4_211_ddmi_get_vcc(MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		return (ddmi_cali->vcc + ADC0_get_vcc()); //uint:0.1mv
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return ADC0_get_vcc();  //uint:0.1mV
	}

	return GOS_FAIL;
}

uint16_t CWDM4_211_ddmi_get_bias(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	QSFP_MSA_PAGE_T  *lower_page  = MSA_get_page_ptr(MSA_PAGE_LOWER);
	uint8_t tx_dis = U8_LSB_4BITS(lower_page->ptr[OFFSET_INDEX(MSA_OFFSET_LOWER_TX_DISABLE)]);

	if(GET_BIT(tx_dis, channel) || TX_DIS)  //if bit0 = 1, tx disable£¬ TX_DIS = 1, lower power mode
	{
		return 0;
	}

	if(type == MSA_DRV_VAL_NORM)
	{
		uint16_t bias = 0, bias_offset = 0;
		DDMI_CALI_PARA_T *ddmi_cali  = MSA_p67_get_ddmi_cali_cfg();
		MSA_LUT_T	     *laser_stat = MSA_p4_get_laser_state();

		if(ASSERT(ddmi_cali) || ASSERT(laser_stat))
		{
			return GOS_FAIL;
		}

		//ddmi_cali->bias uint:0.1mA
		if(ddmi_cali->current[channel].bias.bias_offset2 >= ddmi_cali->current[channel].bias.bias_offset1)
		{
			bias_offset = ddmi_cali->current[channel].bias.bias_offset2 - ddmi_cali->current[channel].bias.bias_offset1;
		}
		else
		{
			bias_offset = 0;
		}

		bias  = (uint16_t)((bias_offset + laser_stat->ch[channel].stat.txbias) * 0.1 * 1000.0 * 0.5); //uint:2uA
		return  bias;  //uint:2uA
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return (uint16_t)(cwdm4_211_get_bias(channel));
	}
	return GOS_FAIL;
}

uint16_t CWDM4_211_ddmi_get_rx_power(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		float rxpower_result = 0.0 ,rxpower1 = 0.0, rxpower2 = 0.0, rssi1 = 0.0, rssi2 = 0.0;
		DDMI_CALI_PARA_T *ddmi_cali   = MSA_p67_get_ddmi_cali_cfg();
		MSA_LUT_T 		 *laser_stat  = MSA_p4_get_laser_state();
		RX_CALI_PARA_T   *rx_cali_cfg = MSA_p67_get_rx_cali_cfg();
		static uint8_t    rx_power_state[MSA_CHANNEL_NUM] = {false}; //false: no light; treu:have light

		if(ASSERT(ddmi_cali) || ASSERT(laser_stat) || ASSERT(rx_cali_cfg))
		{
			return GOS_FAIL;
		}

		//ddmi_cali->tx_rx_pwr[channel].rxpower.rxpower1 uint:0.1uw
		rxpower1 = (float)ddmi_cali->current[channel].rxpower.rxpower1 * 0.1 / 1000.0;  //uint:mW
		rxpower2 = (float)ddmi_cali->current[channel].rxpower.rxpower2 * 0.1 / 1000.0;  //uint:mW

		//ddmi_cali->tx_rx_pwr[channel].rxpower.rssi1 uint:uA
		rssi1 	 = (float)ddmi_cali->current[channel].rxpower.rssi1;
		rssi2 	 = (float)ddmi_cali->current[channel].rxpower.rssi2;

		if(rssi2 != rssi1)
		{
			  rxpower_result = rxpower1 + ((float)laser_stat->ch[channel].stat.rssi - rssi1) * ((rxpower2 - rxpower1) / (rssi2 - rssi1));  //uint: mW
		}

		if(laser_stat->ch[channel].stat.rssi >= rx_cali_cfg->rssi_dark.rssi_dark_thld[channel].darkd)
		{
			rx_power_state[channel] = true;
		}

		if(laser_stat->ch[channel].stat.rssi <= rx_cali_cfg->rssi_dark.rssi_dark_thld[channel].darka)
		{
			rx_power_state[channel] = false;
			return 1;
		}

		if(rx_power_state[channel])
		{
			if(rxpower_result <= 0)
			{
				return 1;
			}
			else
			{
				CHECK_POWER_MAX(rxpower_result);
				return (uint16_t)(rxpower_result * 10.0 * 1000.0);  //MSA format uint:0.1uW
			}
		}
		else
		{
			return 1;
		}

	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return  (uint16_t)cwdm4_211_ddmi_get_rssi(channel);  //uint:ua
	}

	return GOS_FAIL;
}

uint16_t CWDM4_211_ddmi_get_tx_power(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	QSFP_MSA_PAGE_T  *lower_page  = MSA_get_page_ptr(MSA_PAGE_LOWER);
	uint8_t tx_dis = U8_LSB_4BITS(lower_page->ptr[OFFSET_INDEX(MSA_OFFSET_LOWER_TX_DISABLE)]);

	if(type == MSA_DRV_VAL_NORM)
	{
		float txpower_result = 0.0, txpower1 = 0.0, txpower2 = 0.0, txmon1 = 0.0, txmon2 = 0.0,txmon_N = 0.0;
		DDMI_CALI_PARA_T    *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		MSA_LUT_T 		    *laser_stat = MSA_p4_get_laser_state();
		SFP_DRV_LASER_CFG_T *lo_cfg = (SFP_DRV_LASER_CFG_T *)MSA_p67_get_drv_lut();
		SFP_DRV_LASER_CFG_T *m_cfg  = (lo_cfg + MSA_CHANNEL_NUM);

		if(ASSERT(ddmi_cali) || ASSERT(laser_stat) ||  ASSERT(lo_cfg) ||  ASSERT(m_cfg))
		{
			return GOS_FAIL;
		}

		if(GET_BIT(tx_dis, channel) || TX_DIS)  //if bit0 = 1, tx disable
		{
			return 1;
		}

		//laser_stat->ch[channel].stat.txpwr uint:0.1mA
		txmon_N = (float)laser_stat->ch[channel].stat.txpwr * 0.1;

		//ddmi_cali->tx_rx_pwr[channel].txpower.txpower uint:0.1uw
		txpower1 = (float)ddmi_cali->current[channel].txpower.txpower1 * 0.1 / 1000.0; //uint:mW
		txpower2 = (float)ddmi_cali->current[channel].txpower.txpower2 * 0.1 / 1000.0; //uint:mW

		//ddmi_cali->tx_rx_pwr[channel].txpower.bias uint:0.1mA
		txmon1 = (float)ddmi_cali->current[channel].txpower.bias1 * 0.1; //uint:mA
		txmon2 = (float)ddmi_cali->current[channel].txpower.bias2 * 0.1; //uint:mA

