paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_211_drv.c
	}
	else
	{
		if(lo_cfg->temp == m_cfg->temp || lo_cfg->temp == hi_cfg->temp || m_cfg->temp == hi_cfg->temp)
		{
			return;
		}

		temp_l = lo_cfg->temp / TEMP_SCALE;
		temp_r = m_cfg->temp  / TEMP_SCALE;
		temp_h = hi_cfg->temp / TEMP_SCALE;

		a1 = (double)lo_cfg->bias /((double)(temp_l - temp_r) * (double)(temp_l - temp_h));
		a2 = (double)m_cfg->bias  /((double)(temp_r - temp_l) * (double)(temp_r - temp_h));
		a3 = (double)hi_cfg->bias /((double)(temp_h - temp_l) * (double)(temp_h - temp_r));

		para.a = a1 + a2 + a3;
		para.b = -a1 * (double)(temp_r + temp_h) - a2 * (double)(temp_l + temp_h) - a3 * (double)(temp_l + temp_r);
		para.c = a1 * (double)(temp_r) * (double)(temp_h) + a2 * (double)(temp_l) * (double)(temp_h) + a3 * (double)(temp_l) * (double)(temp_r);
		ret->bias = (uint16_t)(floor(0.5 + (para.a * pow((float)(cur_temp/TEMP_SCALE), 2.0) + para.b * (float)(cur_temp/TEMP_SCALE) + para.c)));

		a1 = (double)lo_cfg->mod /((double)(temp_l - temp_r) * (double)(temp_l - temp_h));
		a2 = (double)m_cfg->mod  /((double)(temp_r - temp_l) * (double)(temp_r - temp_h));
		a3 = (double)hi_cfg->mod /((double)(temp_h - temp_l) * (double)(temp_h - temp_r));

		para.a = a1 + a2 + a3;
		para.b = -a1 * (double)(temp_r+ temp_h) - a2 * (double)(temp_l + temp_h) - a3 * (double)(temp_l + temp_r);
		para.c =  a1 * (double)(temp_r) * (double)(temp_h) + a2 * (double)(temp_l) * (double)(temp_h) + a3 * (double)(temp_l) * (double)(temp_r);
		ret->mod = (uint16_t)(floor(0.5 + (para.a * pow((float)(cur_temp/TEMP_SCALE), 2.0) + para.b * (float)(cur_temp/TEMP_SCALE) + para.c)));
		ret->cross = 0x2a;
	}
	cwdm4_211_drv_check_laser_ch(ret);
	return ;
}

void CWDM4_211_drv_poll(void)
{
	ADC0_poll();
	return ;
}

void CWDM4_211_set_low_power(uint8_t enable)
{
	if(enable)
	{
		//close tx3v3 in order to realize low power mode
		MSA_pin_set_low_power_mode(0);
		IT01CF &= ~IT01CF_IN0PL__ACTIVE_HIGH;
		TX_DIS = 1;
		SDA_M = 0;
		SCL_M = 0;

	}
	else
	{
	   //open tx3v3 in order to realize high power mode
		MSA_pin_set_low_power_mode(1);
		IT01CF |= IT01CF_IN0PL__ACTIVE_HIGH;

		TX_DIS = 0;
		SDA_M = 1;
		SCL_M = 1;
	}
}

void CWDM4_211_update_dev_ready_status()
{
	_i2c_dev_ready = 0;
	_cwdm4_211_rxcdr_check_exist();  //update  _i2c_dev_ready
	_cwdm4_211_txcdr_check_exist();  //update  _i2c_dev_ready
}

#if defined(HW_VER_SEMTEC_AM1_211)
void CWDM4_211_set_tx_enable(uint8_t enable)
{
	uint8_t value = 0;

	_cwdm4_211_txcdr_gn2105_i2c_read_byte(0x433,&value);
	value = CLEAR_LSB_4BITS(value) | CLEAR_MSB_4BITS(enable);
	_cwdm4_211_txcdr_gn2105_i2c_write_byte(0x433, value);
	_cwdm4_211_txcdr_gn2105_i2c_read_byte(0x433,&value);
}
#endif

#if defined(HW_VER_MAXIM_AM1_211) || defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)
void CWDM4_211_set_tx_enable(uint8_t enable)
{
	uint8_t ch = 0, value = 0;
	const uint8_t page_select[] = {0x12, 0x52, 0x92, 0xd2};

	enable = ~(enable & 0xF);  //because MSA is 1:disable, 0:enable, txcdr is 1:enable, 0:disable

	for(ch = 0; ch < MSA_CHANNEL_NUM; ch++)
	{
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x00, page_select[ch]);    //select page

		_cwdm4_211_txcdr_max24025_i2c_read_byte(0x1A, &value);
		value = (value & 0xFE) | GET_BIT(enable, ch);
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x1A, value);
	}
}
#endif

#if defined(HW_VER_SEMTEC_AM1_211)
MSA_INTR_STATUS_T *CWDM4_211_get_drv_intr_status(uint8_t intr_mask)
{
	static MSA_INTR_STATUS_T status;
	uint8_t value = 0;

	if(intr_mask & PORT_INTR_TX_FAULT)
	{
		_cwdm4_211_txcdr_gn2105_i2c_read_byte(0x437, &value);  //get tx fault
		status.tx_fault = (value & 0x0F);
	}
	if(intr_mask & PORT_INTR_TX_LOS)
	{
		_cwdm4_211_txcdr_gn2105_i2c_read_byte(0x413, &value);  //get tx los
		status.tx_los = (value & 0x0F);
	}
	if(intr_mask & PORT_INTR_TX_LOL)
	{
		_cwdm4_211_txcdr_gn2105_i2c_read_byte(0x413, &value);  //get tx lol
		status.tx_lol = (value & 0xF0) >> 4;
	}
	if(intr_mask & PORT_INTR_RX_LOL)
	{
		_cwdm4_211_rxcdr_m37244_i2c_read_byte(0x17, &value);  //get rx lol
		status.rx_lol = REVERSE_LSB_4BITS(((value & 0xF0) >> 4));
	}
	if(intr_mask & PORT_INTR_RX_LOS)
	{
		_cwdm4_211_rxcdr_m37244_i2c_read_byte(0x17, &value);  //get rx los
		status.rx_los = REVERSE_LSB_4BITS(value & 0x0F);
	}
	return &status;
}
#endif


static uint8_t _cwdm4_211_get_avg_rx_los(void)
{
	uint8_t ch = 0;
	MSA_LUT_T 		  *stat       = MSA_p4_get_laser_state();
	RX_CALI_PARA_T   *rx_cali_cfg = MSA_p67_get_rx_cali_cfg();
	QSFP_MSA_PAGE_T   *const pg3  = MSA_get_page_ptr(MSA_PAGE_03H);

	for(ch = 0; ch < MSA_CHANNEL_NUM; ch ++)
	{
		if(stat->ch[ch].stat.rssi >= rx_cali_cfg->avg_rx_los.rx_los_thld[ch].losd)
		{
			_rx_los &= (~(1 << ch));
		}

		if(stat->ch[ch].stat.rssi <= rx_cali_cfg->avg_rx_los.rx_los_thld[ch].losa)
		{
			_rx_los |= (1 << ch);
		}
	}

	__cwdm4_211_update_rxcdr_by_rxlos(pg3->ptr[OFFSET_INDEX(MSA_OFFSET_PAGE_03H_RX_TX_SQ)], _rx_los);

	return _rx_los;
}

#if defined(HW_VER_MAXIM_AM1_211) || defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)
void  CWDM4_211_get_drv_intr_status(MSA_INTR_STATUS_T *status)
{
	static uint8_t prev_fault = 0;
	const uint8_t page_select[] = {0x12, 0x52, 0x92, 0xd2};
	uint8_t tx_los_fault = 0, tx_lol = 0, value = 0, ch = 0;
	RX_CALI_PARA_T *rx_cali_cfg = MSA_p67_get_rx_cali_cfg();


	for(ch = 0; ch < MSA_CHANNEL_NUM; ch++)
	{
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x00, page_select[ch]);    //select page
		_cwdm4_211_txcdr_max24025_i2c_read_byte(0x1f, &tx_los_fault); 		//get tx los and get tx fault

		//because 0x1f is read clear, tx_faule and tx_los must be updated at the same time
		status->tx_fault |= (GET_BIT(tx_los_fault, 3) | GET_BIT(tx_los_fault, 4) | GET_BIT(tx_los_fault, 6)) << ch;
		status->tx_los   |= GET_BIT(tx_los_fault, 5) << ch;

		_cwdm4_211_txcdr_max24025_i2c_read_byte(0x24, &tx_lol);  			//get tx lol
		status->tx_lol   |= GET_BIT(tx_lol, 3) << ch;
	}

	if((U8_LSB_4BITS(prev_fault)) && (!U8_LSB_4BITS(status->tx_fault)))  //prev result have fault and this not have faults indicat fault loss
	{
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x01, 0xa2);  			//clear tx fault
	}

	prev_fault = status->tx_fault;  //save prev result

