paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_211_drv.c
	_cwdm4_211_rxcdr_m37244_i2c_read_byte(0x17, &value);  //get rx lol and rx los
	status->rx_lol = REVERSE_LSB_4BITS(((value & 0xF0) >> 4));

	if(rx_cali_cfg->avg_rx_los.rx_los_mod) //if rx_cali_cfg->rx_los_mod = 0x1, OMA rx_los, get los from rxcdr
	{
		status->rx_los = REVERSE_LSB_4BITS(value & 0x0F);
	}
	else   //if rx_cali_cfg->rx_los_mod = 0x0, AVG rx_los, get los from MCU
	{
		status->rx_los = _cwdm4_211_get_avg_rx_los();  //because _cwdm4_211_get_avg_rx_los is already reverse, there is no need to reverse again
	}
}
#endif

#if defined(HW_VER_SEMTEC_AM1_211)
//MSA Lower page byte98 for txcdr and rxcdr cdr control
void CWDM4_211_set_cdr_control(uint8_t value)
{
	uint8_t tx_cdr_control = 0, rx_cdr_control = 0, tmp = 0, i = 0;
	uint16_t reg_addr[] = {0x000, 0x100, 0x200, 0x300};

	tx_cdr_control = ((~value) & 0xF0) >> 4;
	rx_cdr_control = ((~value) & 0x0F);
	rx_cdr_control = REVERSE_LSB_4BITS(rx_cdr_control);

	for(i = 0; i < MSA_CHANNEL_NUM; i++)
	{
		_cwdm4_211_txcdr_gn2105_i2c_read_byte(reg_addr[i], &tmp);  //set tx cdr control
		tmp = CLEAR_BIT(tmp, 0);
		tmp |= GET_BIT(tx_cdr_control,i);
		_cwdm4_211_txcdr_gn2105_i2c_write_byte(reg_addr[i], tmp);  //set tx cdr control
	}

	_cwdm4_211_rxcdr_m37244_i2c_read_byte(0x10,&tmp);
	tmp = CLEAR_LSB_4BITS(tmp)| rx_cdr_control;
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x10, tmp);  //set rx cdr control
}
#endif

#if defined(HW_VER_MAXIM_AM1_211) || defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)
//MSA Lower page byte98 for txcdr and rxcdr cdr control
void CWDM4_211_set_cdr_control(uint8_t value)
{
	uint8_t tx_cdr_control = 0, rx_cdr_control = 0, tmp = 0, i = 0;

	tx_cdr_control = (value & 0xF0) >> 4;
	rx_cdr_control = ((~value) & 0x0F);  					  //because macom rxcdr 37244 control level is inverse with MSA define
	rx_cdr_control = REVERSE_LSB_4BITS(rx_cdr_control);

	_cwdm4_211_txcdr_max24025_i2c_read_byte(0x02, &value);    //0x2 is global register
	value = (value & 0x0F) | (tx_cdr_control << 4);
	_cwdm4_211_txcdr_max24025_i2c_write_byte(0x02, value);

	_cwdm4_211_rxcdr_m37244_i2c_read_byte(0x10,&tmp);
	tmp = CLEAR_LSB_4BITS(tmp)| rx_cdr_control;
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x10, tmp);  //set rx cdr control
}
#endif

#if defined(HW_VER_SEMTEC_AM1_211)
//MSA page3 byte234 byte235 for tx eq, MSA value is range from 0 ~ 10
void CWDM4_211_set_tx_eq(uint8_t channel, uint8_t value)
{
	uint8_t eq_table[11] = {30,58,73,80,84,88,91,94,97,101,106};
	uint8_t tmp = 0;

	channel = 0;

	if(value == 0xFF)  //indicates there is not adaptive mode
	{
		return;  //do nothing
	}

	value = (value > 10) ? 10 : value;  //value is range from 0 ~ 10
}
#endif

#if defined(HW_VER_MAXIM_AM1_211) || defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)
//MSA page3 byte234 byte235 for tx eq, MSA value is range from 0 ~ 10
void CWDM4_211_set_tx_eq(uint8_t channel, uint8_t value)
{
	const uint8_t page_select[] = {0x12, 0x52, 0x92, 0xd2};
	uint8_t eq_table[11] = {30,58,73,80,84,88,91,94,97,101,106};
	uint8_t tmp = 0;

	if(value == 0xFF)  //indicates there is not adaptive mode
	{
		return;  //do nothing
	}

	value = (value > 10) ? 10 : value;  //value is range from 0 ~ 10

	_cwdm4_211_txcdr_max24025_i2c_write_byte(0x00, page_select[channel]);    //select page
	_cwdm4_211_txcdr_max24025_i2c_read_byte(0x0C, &tmp);
	tmp = (tmp & 0x80) | eq_table[value];  	  						//0x0C register bit[0:6]
	_cwdm4_211_txcdr_max24025_i2c_write_byte(0x0C, tmp);
}
#endif


//MSA page3 byte236 byte237 for tx eq
void CWDM4_211_set_rx_emphasis(uint8_t channel, uint8_t value)
{
	uint8_t reg_addr[] = {0x46, 0x46,0x47,0x47};
	uint8_t rx_emphasis[] = {0x0, 0x3, 0x5, 0x7,0x9, 0xb, 0xd, 0xf};
	uint8_t tmp = 0;

	if(value > RX_EMPHASIS_MAX_VALID)
	{
		return ;
	}

	//rx channel reverse
	channel = 3 - channel;

	_cwdm4_211_rxcdr_m37244_i2c_read_byte(reg_addr[channel], &tmp); //rxcdr pin is inverted sequence with qsfp28 pin

	if(channel == 0x0 || channel == 0x2)
	{
		//write channel1 and channel3
		value = CLEAR_LSB_4BITS(tmp) | (rx_emphasis[value]);
	}
	else if(channel == 0x1 || channel == 0x3)
	{
		//write channel2 and channel4
		value = CLEAR_MSB_4BITS(tmp) | rx_emphasis[value] << 4;
	}

	_cwdm4_211_rxcdr_m37244_i2c_write_byte(reg_addr[channel], value);//rxcdr pin is inverted sequence with qsfp28 pin
}

//MSA Page3 byte238 and byte239 rx amplitude
//0x3 900  --0x3f
//0x2 600  --0x23
//0x1 450  --0x14
//0x0 250  --0x05
void CWDM4_211_set_rx_amplitude(uint8_t channel, uint8_t value)
{
	uint8_t reg_addr[] = {0x42,0x43,0x44,0x45};
	uint8_t rx_amplitude[] = {0x05, 0x14, 0x23, 0x3f};
	uint8_t tmp = 0;

	if(value > RX_AMPLITUDE_MAX_VALID)
	{
		return;
	}

	//rx channel reverse
	channel = 3 - channel;

	_cwdm4_211_rxcdr_m37244_i2c_read_byte(reg_addr[channel], &tmp);//rxcdr pin is inverted sequence with qsfp28 pin

	value = (tmp & 0xC0) | rx_amplitude[value];

	_cwdm4_211_rxcdr_m37244_i2c_write_byte(reg_addr[channel], value);
}

#if defined(HW_VER_SEMTEC_AM1_211)
//MSA Page3 byte240 for txcdr and rxcdr sq disable
void CWDM4_211_set_cdr_sq_disable(uint8_t value)
{
	uint8_t tx_sq = 0, rx_sq = 0, tmp = 0, i = 0;
	const uint16_t reg_addr[] = {0x014, 0x114, 0x214, 0x314};

	rx_sq = (value & 0xF0) >> 4;
	tx_sq  = ~(value & 0x0F);
	rx_sq = REVERSE_LSB_4BITS(rx_sq);

	for(i = 0; i < MSA_CHANNEL_NUM; i++)
	{
		tmp = 0;
		_cwdm4_211_txcdr_gn2105_i2c_read_byte(reg_addr[i], &tmp);  //set tx cdr control
		tmp = CLEAR_BIT(tmp, 0);
		tmp |= GET_BIT(tx_sq,i);
		_cwdm4_211_txcdr_gn2105_i2c_write_byte(reg_addr[i], tmp);  //set tx cdr control
	}

	_cwdm4_211_rxcdr_m37244_i2c_read_byte(0x40,&tmp);
	tmp = CLEAR_MSB_4BITS(tmp)| (rx_sq << 4);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x40, tmp);  //set rx cdr control
}
#endif

static void __cwdm4_211_update_rxcdr_by_rxlos(uint8_t rx_sq, uint8_t rx_los)
{
	static uint8_t prev_rx_los = 0;
	uint8_t ch = 0, rx_los_new = 0, tmp = 0;

	for(ch = 0; ch < MSA_CHANNEL_NUM; ch ++)
	{
		if((GET_BIT(rx_sq, ch) == 0x0) && GET_BIT(rx_los, ch)) //if GET_BIT(rx_sq, ch) = 0x0, reverse rx_los, if GET_BIT(rx_sq, ch) = 0x1, do nothing
		{
			rx_los_new |= (1 << (3 - ch));
		}
	}

	if(prev_rx_los != rx_los_new)
	{
		prev_rx_los = rx_los_new;
		_cwdm4_211_rxcdr_m37244_i2c_read_byte(0x40,&tmp);
		tmp = (CLEAR_LSB_4BITS(tmp)| rx_los_new);
		_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x40, tmp);  //set rx cdr control
	}
}


