paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_211_drv.c
//MSA Page3 byte240 for txcdr and rxcdr sq disable
#if defined(HW_VER_MAXIM_AM1_211) || defined(HW_VER_MAXIM_AM2_211) || defined(HW_VER_MAXIM_AM3_211)
void CWDM4_211_set_cdr_sq_disable(uint8_t value)
{
	uint8_t tx_sq = 0, rx_sq = 0, rx_sq_reverse = 0,tmp = 0, ch = 0;
	const uint8_t page_select[] = {0x12, 0x52, 0x92, 0xd2};
	RX_CALI_PARA_T 			*rx_cali_cfg = MSA_p67_get_rx_cali_cfg();

	rx_sq  			= (value & 0xF0) >> 4;
	rx_sq_reverse   = REVERSE_LSB_4BITS(rx_sq);
	tx_sq 			= ~(value & 0x0F);

	for(ch = 0; ch < MSA_CHANNEL_NUM; ch++)
	{
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x00, page_select[ch]);    //select page
		_cwdm4_211_txcdr_max24025_i2c_read_byte(0x1A, &value);
		value = (value & 0xF7) | (GET_BIT(tx_sq, ch) << 3);  	  //0x1A register bit[3]
		_cwdm4_211_txcdr_max24025_i2c_write_byte(0x1A, value);
	}

	if(rx_cali_cfg->avg_rx_los.rx_los_mod)   //if rx_cali_cfg->rx_los_mod = 0x1, OMA rx_los, get los from rxcdr
	{
		_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x16,0x00);  //enable chip rx_los detect
		_cwdm4_211_rxcdr_m37244_i2c_read_byte(0x40,&tmp);
		tmp = CLEAR_MSB_4BITS(tmp)| (rx_sq_reverse << 4);
		_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x40, tmp);  //set rx cdr control
	}
	else  //if rx_cali_cfg->rx_los_mod = 0x0, AVG rx_los, get los from MCU
	{
		__cwdm4_211_update_rxcdr_by_rxlos(rx_sq, _rx_los);
	}

}
#endif


//MSA Page3 byte241 for rxcdr output disable
void CWDM4_211_set_rx_output_disable(uint8_t value)
{
	uint8_t rx_output_disable = 0,  tmp = 0;

	if(TX_DIS)  //if TX_DIS = 1, indicate lower power
	{
		value = 0xFF;  //Only allows to configure 0xFF in lower power mode
	}

	rx_output_disable = (value & 0xF0) >> 4;
	rx_output_disable = REVERSE_LSB_4BITS(rx_output_disable);

	_cwdm4_211_rxcdr_m37244_i2c_read_byte(0x10,&tmp);
	tmp = CLEAR_MSB_4BITS(tmp)| (rx_output_disable << 4);
	_cwdm4_211_rxcdr_m37244_i2c_write_byte(0x10, tmp);
}

//MSA Page3 byte234 byte235 byte241 for tx adapt eq
void CWDM4_211_set_tx_adapt_eq(uint8_t byte241, uint8_t byte234, uint8_t byte235)
{
	uint8_t tmp = 0, tx_adapt_eq = 0,channel;

	tx_adapt_eq = (byte241 & 0x0F);

	for(channel = 0; channel < MSA_CHANNEL_NUM; channel ++)
	{
		if(GET_BIT(tx_adapt_eq, channel) == 0x1) //adapt eq is enable,do nothing
		{

		}
		else  //adapt eq is disable
		{
			if(channel >= 0x0 && channel < 0x2)
			{
				tmp = ((byte234) >> (4 * ((channel + 1) % 2))) & 0x0F;
			}
			else if(channel >= 0x2 && channel < MSA_CHANNEL_NUM)
			{
				tmp = ((byte235) >> (4 * ((channel + 1) % 2))) & 0x0F;
			}
			CWDM4_211_set_tx_eq(channel, tmp);
		}
	}
}

#endif




